In [2]:
import pandas as pd

In [9]:
df = pd.read_csv("data/salaries_by_college_major.csv")
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [10]:
df.shape # attribute not a function so no need for parenthesis ()

(51, 6)

In [11]:
df.columns # attribute

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

### Let's rename the columns to be code friendly
- Replace space by _
- Replace Percentile with prc
- Delete seperating -

In [16]:
def clean_func_name(name:str) -> str:
    x = [" ", "Percentile", "-"]
    y = ["_", "Prc",""]

    new_name = name
    for (s, n) in zip(x,y):
        new_name = new_name.replace(s, n)
    return new_name


df.columns = list(map(clean_func_name, df.columns))
df.head()

,Undergraduate_Major,Starting_Median_Salary,MidCareer_Median_Salary,MidCareer_10th_Prc_Salary,MidCareer_90th_Prc_Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

### Check for missing values

In [17]:
df.isna().sum()

Undergraduate_Major          0
Starting_Median_Salary       1
MidCareer_Median_Salary      1
MidCareer_10th_Prc_Salary    1
MidCareer_90th_Prc_Salary    1
Group                        1
dtype: int64

In [18]:
# only one row has NAs so drop that row with dropna()
df = df.dropna()
df.tail()

,Undergraduate_Major,Starting_Median_Salary,MidCareer_Median_Salary,MidCareer_10th_Prc_Salary,MidCareer_90th_Prc_Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

### Check for duplicated rows (remove them if found)

```df.duplicated()``` only returns the extra occurences of rows (and not the first original one). This makes it easy to drop them using:<br>
```df = df.loc[~df.duplicated()]```

Can also pass list of column names to duplicated() if we only want to detect duplicate values on some columns.
E.g.<br>
```df = df.loc[~df.duplicated(subset=['Coaster_Name','Location','Opening_Date'])].reset_index(drop=True).copy()```

```.reset_index``` generates a new index, ```drop=True``` tells it to not save the old index in a column. 

Also can do:<br>
```df.drop_duplicates(subset=['brand'])```<br>
or<br>
```df.drop_duplicates(subset=['brand', 'style'], keep='last')```

In [21]:
df.loc[df.duplicated()]
# no duplicates found.

df = df.drop_duplicates()
df.shape

(50, 6)

### Descriptive statistics
Generate descriptive statistics, correlations and basic plots

In [25]:
df.columns

Index(['Undergraduate_Major', 'Starting_Median_Salary',
       'MidCareer_Median_Salary', 'MidCareer_10th_Prc_Salary',
       'MidCareer_90th_Prc_Salary', 'Group'],
      dtype='object')

In [24]:
# value counts for categorical column
df['Group'].value_counts()

Group
HASS        22
STEM        16
Business    12
Name: count, dtype: int64

In [27]:
# Descriptive statistics on numerical columns

df[['Starting_Median_Salary',
       'MidCareer_Median_Salary', 'MidCareer_10th_Prc_Salary',
       'MidCareer_90th_Prc_Salary']].agg(["min","mean","max"])

,Starting_Median_Salary,MidCareer_Median_Salary,MidCareer_10th_Prc_Salary,MidCareer_90th_Prc_Salary
min,34000.0,52000.0,26700.0,96400.0
mean,44310.0,74786.0,43408.0,142766.0
max,74300.0,107000.0,71900.0,210000.0

In [30]:
# which major has the highest starting salary
df.loc[df['Starting_Median_Salary'].idxmax()]

Undergraduate_Major          Physician Assistant
Starting_Median_Salary                   74300.0
MidCareer_Median_Salary                  91700.0
MidCareer_10th_Prc_Salary                66400.0
MidCareer_90th_Prc_Salary               124000.0
Group                                       STEM
Name: 43, dtype: object

In [31]:
# which major has the highest mid career salary
df.loc[df['MidCareer_Median_Salary'].idxmax()]

Undergraduate_Major          Chemical Engineering
Starting_Median_Salary                    63200.0
MidCareer_Median_Salary                  107000.0
MidCareer_10th_Prc_Salary                 71900.0
MidCareer_90th_Prc_Salary                194000.0
Group                                        STEM
Name: 8, dtype: object

In [32]:
# which major has the lowest starting salary
df.loc[df['Starting_Median_Salary'].idxmin()]

Undergraduate_Major          Spanish
Starting_Median_Salary       34000.0
MidCareer_Median_Salary      53100.0
MidCareer_10th_Prc_Salary    31000.0
MidCareer_90th_Prc_Salary    96400.0
Group                           HASS
Name: 49, dtype: object

### Summary
* Physician assistant has the highest starting salary (median of 74,300)
* Spanish has the lowest starting salary (median of 34,000)
* Chemical engineering has the highest mid-career salary (median of 107,000)

### Find majors with less dispersion between low and high salaries
This majors are low risk as everyone tends to get the same salary.

In [33]:
df['Salary_Range'] = df['MidCareer_90th_Prc_Salary'] - df['MidCareer_10th_Prc_Salary']

df.sort_values('Salary_Range').head() # show 5 majors with lowest spread (range)

,Undergraduate_Major,Starting_Median_Salary,MidCareer_Median_Salary,MidCareer_10th_Prc_Salary,MidCareer_90th_Prc_Salary,Group,Salary_Range
40,Nursing,54200.0,67000.0,47600.0,98300.0,Business,50700.0
43,Physician Assistant,74300.0,91700.0,66400.0,124000.0,STEM,57600.0
41,Nutrition,39900.0,55300.0,33900.0,99200.0,HASS,65300.0
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS,65400.0
27,Health Care Administration,38800.0,60600.0,34600.0,101000.0,Business,66400.0

In [35]:
# for high risk majors sort descending
df.sort_values('Salary_Range', ascending=False).head()

,Undergraduate_Major,Starting_Median_Salary,MidCareer_Median_Salary,MidCareer_10th_Prc_Salary,MidCareer_90th_Prc_Salary,Group,Salary_Range
17,Economics,50100.0,98600.0,50600.0,210000.0,Business,159400.0
22,Finance,47900.0,88300.0,47200.0,195000.0,Business,147800.0
37,Math,45400.0,92400.0,45200.0,183000.0,STEM,137800.0
36,Marketing,40800.0,79600.0,42100.0,175000.0,Business,132900.0
42,Philosophy,39900.0,81200.0,35500.0,168000.0,HASS,132500.0

### Summary
* Nursing is the lowest risk major (lowest spread)
* Economics is the highest risk major (highest spread)

### Grouping and Pivoting Data

In [42]:
pd.options.display.float_format = '{:,.2f}'.format 
df[['Group', 'Starting_Median_Salary', 'MidCareer_Median_Salary', 'Salary_Range']].groupby('Group').mean()

          Starting_Median_Salary  MidCareer_Median_Salary  Salary_Range
Group
Business               44,633.33                75,083.33    103,958.33
HASS                   37,186.36                62,968.18     95,218.18
STEM                   53,862.50                90,812.50    101,600.00